vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/EXTI_reginfo.h
/* This file is generated by stm32_reggen.py from stm32c092xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the EXTI register metadata for the stm32c092 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_c092_exti_reginfo[RI_END] =
{
	[RI_RTSR1          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_FTSR1          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_SWIER1         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_RPR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_FPR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_EXTICR1        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x07070707 }, /* mask = 0b00000111000001110000011100000111 */
	[RI_EXTICR2        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x07070707 }, /* mask = 0b00000111000001110000011100000111 */
	[RI_EXTICR3        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x07070707 }, /* mask = 0b00000111000001110000011100000111 */
	[RI_EXTICR4        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x07070707 }, /* mask = 0b00000111000001110000011100000111 */
	[RI_IMR1           ] = { .reset_val = 0xFFF80000, .not_reserved = true, .unimp_mask = 0x8288FFFF, .mask = 0x8288FFFF }, /* mask = 0b10000010100010001111111111111111 */
	[RI_EMR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x828FFFFF, .mask = 0x828FFFFF }, /* mask = 0b10000010100011111111111111111111 */
};

